<?php

$mainValues = [
    'banned' => '🚫  متأسفانه به دلیل عدم رعایت ضوابط و مقررات، دسترسی شما به این ربات محدود گردیده است. 😔',
    'customer_custome_plan_day' =>  "⌛  لطفاً مدت زمان مورد نظر برای اشتراک را به روز وارد نمایید.\n💰  هزینه هر روز: DAY-PRICE",
    'customer_custome_plan_volume'=>"📡  لطفاً میزان حجم مورد نیاز سرویس را به گیگابایت وارد نمایید.\n💰  هزینه هر گیگابایت: VOLUME-PRICE",
    'customer_custome_plan_name'=> 'لطفاً نام مورد نظر برای پیکربندی را با ترکیبی از حروف انگلیسی و اعداد وارد نمایید.',
    'send_user_id'=> "🆔  لطفاً شناسه عددی کاربر مورد نظر را ارسال فرمایید:",
    'enter_decrease_amount'=>"💸  لطفاً مبلغی را که مایل به کسر آن از موجودی هستید، وارد نمایید:",
    'enter_increase_amount'=> "💸  لطفاً مبلغی را که مایل به افزودن به موجودی هستید، وارد نمایید:",
    'user_not_found'=>"😕  متأسفانه کاربر مورد نظر یافت نشد. لطفاً شناسه را با دقت بیشتری وارد نمایید.",
    'amount_decreased_from_your_wallet'=> "✅ مبلغ AMOUNT تومان از موجودی حساب شما کسر گردید.",
    'amount_decreased_from_user_wallet'=>"✅ مبلغ AMOUNT تومان از موجودی کیف پول کاربر مورد نظر کسر گردید.",
    'increase_wallet_cart_to_cart'=>"♻️ لطفاً تصویری از فیش واریزی یا اسکرین‌شات ووچر پرفکت مانی را برای ما ارسال نمایید:
🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME
✅ پس از تأیید پرداخت، مبلغ مورد نظر به کیف پول شما افزوده خواهد شد!",
    'order_increase_sent'=>"🥇 سفارش شما با موفقیت ثبت شد.
    بعد از تایید به کیف پولت اضافه میکنم ... 💞",
    'please_send_only_image'=>"لطفا فقط عکس ارسال کنید",
    'reached_main_menu'=>"🛡منوی اصلی ربات بزرگ پروکسی دائمی 🛡

شما میتوانید با دعوت از دوستان خود به ربات درآمد کسب کنید💸جهت استفاده از این امکان گزینه '👥 دعوت از دوستان' را انتخاب کنید
",
    'increase_wallet_request_message'=>"💳 درخواست ( افزایش موجودی )

💰مبلغ: PRICE تومان
🧑‍💻 نام و نام خانوادگی : NAME
🎯 یوزرنیم : @USERNAME
🎫 کد کاربری : <code>USER-ID</code>
",
    'out_of_connection_capacity'=>'ظرفیت این کانکشن پر شده است',
    'out_of_server_capacity'=>'ظرفیت این سرور پر شده است',
    'can_create_specific_account'=> "روی این پلن فقط AMOUNT اکانت میشه ساخت",
    'buy_account_cart_to_cart'=>"♻️ عزیزم یه تصویر از فیش واریزی یا شماره پیگیری -  ساعت پرداخت - نام پرداخت کننده رو در یک پیام برام ارسال کن :

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ بعد از اینکه پرداختت تایید شد ( لینک سرور ) به صورت خودکار از طریق همین ربات برات ارسال میشه!",
    'renew_ccount_cart_to_cart'=>"♻️ عزیزم یه تصویر از فیش واریزی یا شماره پیگیری -  ساعت پرداخت - نام پرداخت کننده رو در یک پیام برام ارسال کن :

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME",
    'order_buy_sent'=>"🛍 سفارشت با موفقیت ثبت شد.
بعد از تایید برات ارسال میکنم ... 🥳",
    'buy_custom_account_request'=>"💓 خرید پلن دلخواه ( TYPE )
    
▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: <a href='tg://user?id=USER-ID'>NAME</a>
⚡️ نام کاربری: @USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'buy_new_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🚦سرور: SERVERNAME
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'buy_new_much_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🏖 تعداد اکانت: ACCOUNT-COUNT
✏️ نام سرویس: REMARK",
'invite_buy_new_account'=>"👨‍👦‍👦 خرید ( زیر مجموعه )

🧝‍♂️آیدی کاربر: USER-ID
🛡اسم کاربر: NAME
🔖 نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🔮 نام سرویس: REMARK
💮 سفارش: FILENAME",
    'renew_order_sent'=>"✅| دوست عزیز ، درخواستت با موفقیت ثبت شد، بعد از بررسی و تمدید ادمین کانفیگ رو برات میفرستم ممنون از صبوریت 
    
🚪 /start",
'renew_account_request_message'=>"♻️ تمدید سرویس ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'increase_account_request_message'=>"⏰ درخواست افزایش ( TYPE سرویس )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎈 نام سرویس: REMARK
🔋TYPE افزایش: INCREASE گیگ/روز
💰قیمت: PRICE تومان",
    'waiting_message'=>'⏳ در حال انتظار ...',
    'join_channel_message'=>"❌ برای استفاده از ربات حتما باید در کانال زیر عضو شوید:
    
✅ بعد از اینکه عضو شدید روی دکمه عضو شدم بزنید

",
    'bot_is_updating'=> " ❌ در حال حاضر ربات به علت بروز رسانی قادر به ارائه خدمت نیست\n\n
    🙃 لطفا بعدا از چند دقیقه مجددا تلاش کنید",
    'select_one_to_show_detail'=> ' 🔅 یکی از سرویس هاتو انتخاب کن و مشخصات کاملش رو ببین :',
    'you_dont_have_config'=>'شما در حال حاضر بسته VPN فعالی ندارید 🔒',
    'no_order_found'=> "موردی یافت نشد",
    'config_details_message'=>"وضعیت کانفیگ: STATE
    
🔮 نام کانفیگ : NAME

لینک اتصال: CONNECT-LINK

لینک سابسکریبشن: SUB-LINK
⁮⁮ ⁮⁮ ⁮⁮ ⁮⁮
",
    'please_wait_message' => "🕰️ لطفاً صبور باشید...",
    'send_only_number' => "😊 عزیز، لطفاً صرفاً اعداد انگلیسی را وارد نمایید.",    
    'change_bot_settings_message' => "🔧 هر یک از امکانات را که در ربات مورد استفاده قرار نمی‌گیرد، غیرفعال (خاموش) نمایید!",
    'saved_successfuly' => "✅  با موفقیت ذخیره گردید.",
    'invited_user_joined_message' => "😍  تبریک، یک کاربر جدید با استفاده از لینک دعوت شما به ربات پیوسته است.",
    'please_select_from_below_buttons' => "🔘  لطفاً از دکمه‌های زیر استفاده نمایید.",
    'use_iranian_number_only'=>"🔘لطفا فقط با شماره ایرانی اقدام کنید",
    'phone_confirmed' => "✅  شماره تلفن شما با موفقیت تأیید گردید.",
    'send_your_phone_number' => "سلام گرامی، برای استفاده از ربات، لطفاً شماره تماس خود را با استفاده از دکمه زیر ارسال فرمایید: 👇",
    'start_message' => '❇️به منوی اصلی ربات پروکسی دائمی تلگرام خوش آمدید🤗

●پلن های متنوع و مقرون به صرفه👁

●سرعت باورنکردنی🫦

●مدیریت کانفیگ از طریق ربات🤳

●امکان اخذ نمایندگی و دریافت تخفیف دائمی🫂

●[پشتیبانی خوش اخلاق💁‍♀](t.me/ProxyDaemivpnsupport)

Powered by @ProxyDaemi™',
    'new_member_joined'=>"FULLNAME به ربات ما پیوست! 🎉
    آیدی کاربری: @USERNAME
    آیدی عددی: USERID
    ",
    "not_joine_yet"=>"هنوز که عضو کانال نشدی",
    'insert_discount_code'=>"🎁|کد تخفیف تو را وارد کن:",
    "not_valid_discount_code"=>"😔|کد تخفیفی که وارد کردی معتبر نیس",
    'valid_discount_code'=>"✅|کد تخفیف با موفقیت استفاده شد
مقدار تخفیف AMOUNT تومان",
'used_discount_code'=>"☑️|🎁 کد تخفیف استفاده شد

🔰آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎁 کد تخفیف: DISCOUNTCODE
💰مقدار تخفیف: AMOUNT تومان
⁮⁮ ⁮⁮",
"send_config_uuid"=>"برای دریافت اطلاعات کانفیگ لینک کامل آن را کپی کن و بصورت کامل اینجا برام بفرست👁",
'not_correct_text'=>"متن وارد شده معتبر نمی باشد",
'receving_information'=>"♻️در حال دریافت جزییات ... ",
'request_agency_message'=>"درخواست نمایندگی

🔰آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
⁮⁮ ⁮⁮",
    'agency_request_sent'=>"درخواست شما با موفقیت ارسال شد، لطفا منتظر باشید!⁮⁮ ⁮⁮",
    'agency_request_already_sent'=>"درخواست شما قبلاً ارسال شده، لطفا منتظر باشید!⁮⁮ ⁮⁮",
    'agency_request_declined'=>"🥺 درخواست شما برای نمایندگی رد گردید",
    'agency_request_approved'=>"✅ درخواست شما برای نمایندگی تأیید شد",
    'send_agent_discount_percent' =>"لطفا مقدار تخفیف این نمایندگی را  به صورت درصد وارد کنید، مثلا 10",
    'agent_setting_message' =>" 🧚🏻‍♀️ نماینده محترم:

از این بخش میتوانید خرید تکی و خرید انبوه داشته باشید و همچنین کانفیگ های خریداری شده را مدیریت کنید",
    'selling_is_off'=>"فعلا فروش نداریم",
    'no_server_available'=>"😔 | عزیز دلم هیچ سرور فعالی نداریم لطفا بعدا مجدد تست کن",
    'buy_sub_select_location' => '  1️⃣ مرحله یک:

لوکیشن مدنظرت رو برا خرید انتخاب کن: 😊',
    'the_bot_in_not_admin' => " ربات هنوز تو کانال عضو نشده، ربات رو تو کانال ادمین کن ",
    'category_not_avilable'=>"هیچ دسته بندی برای این سرور وجود ندارد",
    'receive_categories'=>"♻️ | دریافت دسته بندی ...",
    'buy_sub_select_category'=> "2️⃣ مرحله دوم:

دسته بندی مورد نظرت رو انتخاب کن 🤭",
    'no_plan_available'=>"💡پلنی در این دسته بندی وجود ندارد",
    'receive_plans'=>"📍در حال دریافت لیست پلن ها",
    'buy_sub_select_plan'=> "3️⃣ مرحله سه:

یکی از پلن هارو انتخاب کن و برو برای پرداختش 🤲 🕋", 
    'buy_custom_plan'=>'➕ پلن دلخواه تو بخر',
    'select_one_plan_to_edit'=>"یکی از پلن ها رو انتخاب کن تا برات ویرایشش کنم", 
    'enter_account_amount' => "♻️ تعداد اکانت درخواستی رو وارد کن حداکثر هربار 6 عدد:

⚠️ | نکته: در صورت وارد کردن به مقدار بالا احتمالا اکانت ساخته نشود و پنل x-ui گیر کند",
    'send_positive_number'=>"لطفا عددی بزرگتر از 0 وارد کنید",
    'buy_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_much_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        تعداد اکانت: ACCOUNT-COUNT
        قیمت پنل: PRICE
        ➖➖➖➖➖➖➖
        💎 قیمت کل : TOTAL-PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_custom_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        حجم اختصاصی: VOLUME GB
        مدت اختصاصی: DAYS روز
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    "agents_list" => "🔍 لیست نمایندگان:

جهت مشاده آمار فروش نمایندگان روی اسم نماینده کلیک کنید، همچنین میتوانید برای نماینده درصد تعیین کنید یا آن را از لیست نمایندگان خارج کنید",
    'agent_deleted_successfuly'=>"نمایندگی با موفقیت حذف شد",
    'agent_details'=>'🙎‍♂️اطلاعات نماینده AGENT-NAME

سمت راست درآمد و سمت چپ تعداد خرید نماینده می باشد',
    'send_config_remark'=>"لطفا ریمارک کانفیگ را وارد کنید",
    'forward_your_message'=>"لطفا پیام مورد نظر خود را به ربات فروارد کنید",
    "enter_ticket_title"=>"💠لطفا موضوع تیکت را ارسال کنید!",
    "enter_ticket_description"=> "💠لطفا متن و یا عکس تیکت را بصورت ساده و مختصر ارسال کنید!",
    "sent_config_to_user"=> '✅ کانفیگ و براش ارسال کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    "renewed_config_to_user"=> '✅ کانفیگ و براش تمدید کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    'sending_config_to_user'=>'🚀 | 😍 در حال ارسال کانفیگ به مشتری ...',
    'config_not_found'=>"مشکلی پیش اومده، دوباره از نو انجام بده",
    'incorrect_config_name'=>"'اسمی که وارد کردی معتبر نیست لطفا مجددا امتحان کن'",
    'pay_with_tron_wallet'=>"♻️ عزیزم مبلغ AMOUNT ترون رو به والت زیر ارسال کن و تکسید آیدی واریزی ترون رو برام ارسال کن :

🔰 <code>TRON-WALLET</code>",
    'incorrect_tax_id'=>"تکسید آیدی وارد شده نامعتبر است",
    'used_tax_id'=>"این تکسید آیدی قبلا استفاده شده است",
    'in_review_tax_id'=>"تراکنش شما در صف بررسی قرار گرفت",
    'user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد گردید</b>",
    'your_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد شد</b>",
    'incorrect_user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'your_incorrect_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'partially_paid_user_taxid'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'you_have_partially_paid'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'agent_discount_settings'=>"مدیریت تخفیف های نماینده AGENT-NAME"
];

$buttonValues = [
    'perfectmoney'=>'💸پرداخت با ووچر پرفکت مانی',
    'free_config'=>'🎉دریافت کانفیگ رایگان',
    'bot_reports' => "📊 گزارش عملکرد ربات",
    'message_to_user' => "💬 چت خصوصی با کاربر",
    'user_reports' => "🔍 جزئیات پروفایل کاربر",
    'admins_list' => "👥 لیست مدیران باحال",
    'increase_wallet' => "💰 افزایش موجودی کیف پول",
    'decrease_wallet' => "📉 کاهش موجودی کیف پول",
    'create_account' => "✨ ساخت اکانت های انبوه",
    'ban_user' => "🚫 مسدود کردن کاربر شیطون",
    'unban_user' => "🤗 آزاد کردن کاربر خوب",
    'server_settings' => '⚙️ تنظیمات و مدیریت سرورهای قدرتمند',
    'categories_settings' => '📂 مدیریت دسته بندی های خفن',
    'plan_settings' => '🚀 تنظیمات پلن های پرقدرت',
    'discount_settings' => "🎉 مدیریت تخفیف های باحال",
    'main_button_settings' => "🕹️ تنظیمات دکمه های اصلی",
    'gateways_settings' => '💳 تنظیمات درگاه های پرداخت',
    'bot_settings' => '🤖 تنظیمات ربات فوق العاده',
    'tickets_list' => '📨 لیست تیکت های کاربران',
    'message_to_all' => "📣 ارسال پیام به همه",
    'forward_to_all' => "🔄 فروارد پیام به همه",
    'back_to_main' => '🔙 برگشت به منوی اصلی',
    'cart_to_cart' => "💵 انتقال کارت به کارت (یا ووچر پرفکت مانی)",
    'now_payment_gateway' => "💸 درگاه پرداخت NowPayment",
    'zarinpal_gateway' => "🌟 درگاه پرداخت زرین پال",
    'nextpay_gateway' => "🔮 درگاه پرداخت نکست پی",
    'weswap_gateway' => "💱 درگاه ارزی ریالی",    
    'approve' => 'تأیید ✅',
    'approved' => 'تأیید شد 🥳',
    'decline' => 'رد ❌',
    'declined' => 'رد شد 😔',
    'back_button' => "برگشت 🔙",
    'renew_connection_link' => "🔄 تمدید لینک اتصال",
    'update_config_connection' => "⚡ بروزرسانی کانفیگ",
    'increase_config_volume' => "📈 افزایش حجم سرویس",
    'increase_config_days' => "📆 افزایش زمان سرویس",
    'renew_config' => '♻️ تمدید سرویس',
    'change_config_location' => '🌍 تغییر مکان سرور',
    'selected_protocol' => "🌐 پروتکل انتخابی",
    'volume_left' => "⏳ حجم باقیمانده:",
    'expire_date' => "⌛ تاریخ انقضا:",
    'buy_date' => "📅 تاریخ خرید:",
    'plan_name' => " 🚀 نام پلن:",
    'on' => "روشن 💡",
    'off' => "خاموش 🔌",
    'active' => "فعال 🟢",
    'deactive' => "غیرفعال 🔴",
    'send_phone_number' => '☎️ ارسال شماره تلفن',
    'send_message_to_user' => "✉️ ارسال پیام به کاربر",
    'cancel' => '🫰🏻انصراف و بازگشت به منوی اصلی',
    'join_channel' => "🤖 عضویت در کانال",
    'have_joined' => "✅ عضو شدم",
    'gift_volume_day' => "🎁 هدیه حجم و زمان",
    'test_account' => "🧪 دریافت اکانت تست",
    'invite_friends' => "👥 دعوت از دوستان",
    'my_info' => "👤 پروفایل کاربری من",
    'my_subscriptions' => '📲 سرویس های فعال من',
    'buy_subscriptions' => '🎫 خرید سرویس جدید',
    'shared_existence' => "💰 موجودی اشتراکی",
    'individual_existence' => "💵 موجودی اختصاصی",
    'application_links' => "🎥 آموزش خرید و اتصال",
    'my_tickets' => "📩 تیکت های من",
    'search_config' => "🔍 جستجوی کانفیگ",
    'delete_config' => "❌ حذف کانفیگ",
    'pay_with_wallet' => "پرداخت با موجودی کیف پول🍓",
    'request_agency' => "🤝 درخواست نمایندگی فروش",
    'agency_setting' => "🏭 پنل نمایندگی",
    'agent_one_buy' => "➕ خرید تکی",
    'agent_much_buy' => "📦 خرید انبوه",
    'agent_bought_accounts' => "📈 تعداد خریدها",
    'agent_joined_date' => "📆 تاریخ عضویت",
    'agent_agency_date' => "🗓️ تاریخ نمایندگی",
    "agent_list" => "👤 مدیریت نمایندگان",
    'search_agent_config' => "🔍 جستجوی کانفیگ نماینده",
    'search_admin_config' => "🔍 جستجوی کانفیگ ادمین",
    'sharj' => "💸 ارسال رسید - شارژ کیف پول",
    "qr_config" => "🔳 کیو آر کانفیگ",
    "qr_sub" => "🔳 کیو آر ساب",
    'start_bot' => "🚀 شروع ربات",
    'enable_config' => "✅ فعالسازی کانفیگ",
    'disable_config' => "🚫 غیرفعالسازی کانفیگ",
    "tron_gateway" => "🌌 درگاه پرداخت ترون",
    'plan_discount' => "💰 تخفیف روی پلن",
    'server_discount' => "🌐 تخفیف روی سرور"
];
?>
